Couldn't generate surfaces for stairs.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotGenerateFaces { get; }
  Visual Basic
Public Shared ReadOnly Property CannotGenerateFaces As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotGenerateFaces {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace